app/Controllers/usuario_controller.php

INSERT INTO `usuarios` (`nombre`, `apellido`, `email`, `nombre_usuario`, `pass`, `confirmar_pass`) VALUES ('federico', 'axony', 'federicofer12345@gmail.com', 'fede', '$2y$10$BUexHKpgP0CagDAi1sqWZu688XA/Ba.KptEpGy63L/IxtU2MFlpTO', '1234')
---
    public function formValidation(){
        $model = new usuario_Model();
        $input = $this->validate([
            'nombre'            =>  'required|min_length[4]',
            'apellido'          =>  'required|min_length[4]|max_length[25]',
            'email'             =>  'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'nombre_usuario'    =>  'required|min_length[4]|',
            'pass'              =>  'required|min_length[4]|max_length[15]',
            'confirmar_pass'    =>  'required|min_length[4]|max_length[15]'
            ]);

        $formModel = new usuario_Model();

        if  (!$input) {
            $data['titulo']='registro';
            echo view('front/head_view',$data);
            echo view('front/navbar_view');
            echo view('front/carrusel_view');
            echo view('front/barra_social_view');
            echo view('back/usuario/registro', ['validation' => $this->validator,'titulo' => 'Registro']);
            echo view('front/footer_view');
            echo view('front/scripts_view');

        } else {
            $formModel->save([
            'nombre'            =>  $this->request->getVar('nombre'),
            'apellido'          =>  $this->request->getVar('apellido'),
            'email'             =>  $this->request->getVar('email'),
            'nombre_usuario'    =>  $this->request->getVar('nombre_usuario'),
            'pass'              =>  password_hash($this->request->getVar('pass'), PASSWORD_DEFAULT),
            'confirmar_pass'    =>  $this->request->getVar('confirmar_pass')
            ]);